luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxHssl_bf.h
/** \brief  Length for Ifx_HSSL_ACCEN0_Bits.EN26 */
#define IFX_HSSL_ACCEN0_EN26_LEN (1u)

/** \brief  Mask for Ifx_HSSL_ACCEN0_Bits.EN26 */
#define IFX_HSSL_ACCEN0_EN26_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_ACCEN0_Bits.EN26 */
#define IFX_HSSL_ACCEN0_EN26_OFF (26u)

/** \brief  Length for Ifx_HSSL_ACCEN0_Bits.EN27 */
#define IFX_HSSL_ACCEN0_EN27_LEN (1u)

/** \brief  Mask for Ifx_HSSL_ACCEN0_Bits.EN27 */
#define IFX_HSSL_ACCEN0_EN27_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_ACCEN0_Bits.EN27 */
#define IFX_HSSL_ACCEN0_EN27_OFF (27u)

/** \brief  Length for Ifx_HSSL_ACCEN0_Bits.EN28 */
#define IFX_HSSL_ACCEN0_EN28_LEN (1u)

/** \brief  Mask for Ifx_HSSL_ACCEN0_Bits.EN28 */
#define IFX_HSSL_ACCEN0_EN28_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_ACCEN0_Bits.EN28 */
#define IFX_HSSL_ACCEN0_EN28_OFF (28u)

/** \brief  Length for Ifx_HSSL_ACCEN0_Bits.EN29 */
#define IFX_HSSL_ACCEN0_EN29_LEN (1u)

/** \brief  Mask for Ifx_HSSL_ACCEN0_Bits.EN29 */
#define IFX_HSSL_ACCEN0_EN29_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_ACCEN0_Bits.EN29 */
#define IFX_HSSL_ACCEN0_EN29_OFF (29u)

/** \brief  Length for Ifx_HSSL_ACCEN0_Bits.EN2 */
#define IFX_HSSL_ACCEN0_EN2_LEN (1u)

/** \brief  Mask for Ifx_HSSL_ACCEN0_Bits.EN2 */
#define IFX_HSSL_ACCEN0_EN2_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_ACCEN0_Bits.EN2 */
#define IFX_HSSL_ACCEN0_EN2_OFF (2u)

/** \brief  Length for Ifx_HSSL_ACCEN0_Bits.EN30 */
#define IFX_HSSL_ACCEN0_EN30_LEN (1u)

/** \brief  Mask for Ifx_HSSL_ACCEN0_Bits.EN30 */
#define IFX_HSSL_ACCEN0_EN30_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_ACCEN0_Bits.EN30 */
#define IFX_HSSL_ACCEN0_EN30_OFF (30u)

/** \brief  Length for Ifx_HSSL_ACCEN0_Bits.EN31 */
#define IFX_HSSL_ACCEN0_EN31_LEN (1u)

/** \brief  Mask for Ifx_HSSL_ACCEN0_Bits.EN31 */
#define IFX_HSSL_ACCEN0_EN31_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_ACCEN0_Bits.EN31 */
#define IFX_HSSL_ACCEN0_EN31_OFF (31u)

/** \brief  Length for Ifx_HSSL_ACCEN0_Bits.EN3 */
#define IFX_HSSL_ACCEN0_EN3_LEN (1u)

/** \brief  Mask for Ifx_HSSL_ACCEN0_Bits.EN3 */
#define IFX_HSSL_ACCEN0_EN3_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_ACCEN0_Bits.EN3 */
#define IFX_HSSL_ACCEN0_EN3_OFF (3u)

/** \brief  Length for Ifx_HSSL_ACCEN0_Bits.EN4 */
#define IFX_HSSL_ACCEN0_EN4_LEN (1u)

/** \brief  Mask for Ifx_HSSL_ACCEN0_Bits.EN4 */
#define IFX_HSSL_ACCEN0_EN4_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_ACCEN0_Bits.EN4 */
#define IFX_HSSL_ACCEN0_EN4_OFF (4u)

/** \brief  Length for Ifx_HSSL_ACCEN0_Bits.EN5 */
#define IFX_HSSL_ACCEN0_EN5_LEN (1u)

/** \brief  Mask for Ifx_HSSL_ACCEN0_Bits.EN5 */
#define IFX_HSSL_ACCEN0_EN5_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_ACCEN0_Bits.EN5 */
#define IFX_HSSL_ACCEN0_EN5_OFF (5u)

/** \brief  Length for Ifx_HSSL_ACCEN0_Bits.EN6 */
#define IFX_HSSL_ACCEN0_EN6_LEN (1u)

/** \brief  Mask for Ifx_HSSL_ACCEN0_Bits.EN6 */
#define IFX_HSSL_ACCEN0_EN6_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_ACCEN0_Bits.EN6 */
#define IFX_HSSL_ACCEN0_EN6_OFF (6u)

/** \brief  Length for Ifx_HSSL_ACCEN0_Bits.EN7 */
#define IFX_HSSL_ACCEN0_EN7_LEN (1u)

/** \brief  Mask for Ifx_HSSL_ACCEN0_Bits.EN7 */
#define IFX_HSSL_ACCEN0_EN7_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_ACCEN0_Bits.EN7 */
#define IFX_HSSL_ACCEN0_EN7_OFF (7u)

/** \brief  Length for Ifx_HSSL_ACCEN0_Bits.EN8 */
#define IFX_HSSL_ACCEN0_EN8_LEN (1u)

/** \brief  Mask for Ifx_HSSL_ACCEN0_Bits.EN8 */
#define IFX_HSSL_ACCEN0_EN8_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_ACCEN0_Bits.EN8 */
#define IFX_HSSL_ACCEN0_EN8_OFF (8u)

/** \brief  Length for Ifx_HSSL_ACCEN0_Bits.EN9 */
#define IFX_HSSL_ACCEN0_EN9_LEN (1u)

/** \brief  Mask for Ifx_HSSL_ACCEN0_Bits.EN9 */
#define IFX_HSSL_ACCEN0_EN9_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_ACCEN0_Bits.EN9 */
#define IFX_HSSL_ACCEN0_EN9_OFF (9u)

/** \brief  Length for Ifx_HSSL_AR_Bits.ARW0 */
#define IFX_HSSL_AR_ARW0_LEN (2u)

/** \brief  Mask for Ifx_HSSL_AR_Bits.ARW0 */
#define IFX_HSSL_AR_ARW0_MSK (0x3u)

/** \brief  Offset for Ifx_HSSL_AR_Bits.ARW0 */
#define IFX_HSSL_AR_ARW0_OFF (0u)

/** \brief  Length for Ifx_HSSL_AR_Bits.ARW1 */
#define IFX_HSSL_AR_ARW1_LEN (2u)

/** \brief  Mask for Ifx_HSSL_AR_Bits.ARW1 */
#define IFX_HSSL_AR_ARW1_MSK (0x3u)

/** \brief  Offset for Ifx_HSSL_AR_Bits.ARW1 */
#define IFX_HSSL_AR_ARW1_OFF (2u)

/** \brief  Length for Ifx_HSSL_AR_Bits.ARW2 */
#define IFX_HSSL_AR_ARW2_LEN (2u)

/** \brief  Mask for Ifx_HSSL_AR_Bits.ARW2 */
#define IFX_HSSL_AR_ARW2_MSK (0x3u)

/** \brief  Offset for Ifx_HSSL_AR_Bits.ARW2 */
#define IFX_HSSL_AR_ARW2_OFF (4u)

/** \brief  Length for Ifx_HSSL_AR_Bits.ARW3 */
#define IFX_HSSL_AR_ARW3_LEN (2u)

/** \brief  Mask for Ifx_HSSL_AR_Bits.ARW3 */
#define IFX_HSSL_AR_ARW3_MSK (0x3u)

/** \brief  Offset for Ifx_HSSL_AR_Bits.ARW3 */
#define IFX_HSSL_AR_ARW3_OFF (6u)

/** \brief  Length for Ifx_HSSL_AR_Bits.MAVCH */
#define IFX_HSSL_AR_MAVCH_LEN (2u)

/** \brief  Mask for Ifx_HSSL_AR_Bits.MAVCH */
#define IFX_HSSL_AR_MAVCH_MSK (0x3u)

/** \brief  Offset for Ifx_HSSL_AR_Bits.MAVCH */
#define IFX_HSSL_AR_MAVCH_OFF (16u)

/** \brief  Length for Ifx_HSSL_AW_AWEND_Bits.AWE */
#define IFX_HSSL_AW_AWEND_AWE_LEN (24u)

/** \brief  Mask for Ifx_HSSL_AW_AWEND_Bits.AWE */
#define IFX_HSSL_AW_AWEND_AWE_MSK (0xffffffu)

/** \brief  Offset for Ifx_HSSL_AW_AWEND_Bits.AWE */
#define IFX_HSSL_AW_AWEND_AWE_OFF (8u)

/** \brief  Length for Ifx_HSSL_AW_AWSTART_Bits.AWS */
#define IFX_HSSL_AW_AWSTART_AWS_LEN (24u)

/** \brief  Mask for Ifx_HSSL_AW_AWSTART_Bits.AWS */
#define IFX_HSSL_AW_AWSTART_AWS_MSK (0xffffffu)

/** \brief  Offset for Ifx_HSSL_AW_AWSTART_Bits.AWS */
#define IFX_HSSL_AW_AWSTART_AWS_OFF (8u)

/** \brief  Length for Ifx_HSSL_CFG_Bits.CCC */
#define IFX_HSSL_CFG_CCC_LEN (1u)

/** \brief  Mask for Ifx_HSSL_CFG_Bits.CCC */
#define IFX_HSSL_CFG_CCC_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_CFG_Bits.CCC */
#define IFX_HSSL_CFG_CCC_OFF (19u)

/** \brief  Length for Ifx_HSSL_CFG_Bits.PREDIV */
#define IFX_HSSL_CFG_PREDIV_LEN (14u)

/** \brief  Mask for Ifx_HSSL_CFG_Bits.PREDIV */
#define IFX_HSSL_CFG_PREDIV_MSK (0x3fffu)

/** \brief  Offset for Ifx_HSSL_CFG_Bits.PREDIV */
#define IFX_HSSL_CFG_PREDIV_OFF (0u)

/** \brief  Length for Ifx_HSSL_CFG_Bits.SCM */
#define IFX_HSSL_CFG_SCM_LEN (1u)

/** \brief  Mask for Ifx_HSSL_CFG_Bits.SCM */
#define IFX_HSSL_CFG_SCM_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_CFG_Bits.SCM */
#define IFX_HSSL_CFG_SCM_OFF (18u)

/** \brief  Length for Ifx_HSSL_CFG_Bits.SMR */
#define IFX_HSSL_CFG_SMR_LEN (1u)

/** \brief  Mask for Ifx_HSSL_CFG_Bits.SMR */
#define IFX_HSSL_CFG_SMR_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_CFG_Bits.SMR */
#define IFX_HSSL_CFG_SMR_OFF (17u)

/** \brief  Length for Ifx_HSSL_CFG_Bits.SMT */
#define IFX_HSSL_CFG_SMT_LEN (1u)

/** \brief  Mask for Ifx_HSSL_CFG_Bits.SMT */
#define IFX_HSSL_CFG_SMT_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_CFG_Bits.SMT */
#define IFX_HSSL_CFG_SMT_OFF (16u)

/** \brief  Length for Ifx_HSSL_CLC_Bits.DISR */
#define IFX_HSSL_CLC_DISR_LEN (1u)

/** \brief  Mask for Ifx_HSSL_CLC_Bits.DISR */
#define IFX_HSSL_CLC_DISR_MSK (0x1u)

/** \brief  Offset for Ifx_HSSL_CLC_Bits.DISR */
#define IFX_HSSL_CLC_DISR_OFF (0u)

